Repository: python/pootle-python-org-backup
Catalog: tmxes/pl/library.tmx
Source language: en
Languages: pl

source: If you have positional arguments that must begin with ``'-'`` and don't look like negative numbers, you can insert the pseudo-argument ``'--'`` which tells ``parse_args`` that everything after that is a positional argument::
pl: Jeśli masz pozycyjne parametry które muszą zaczynać się od ``'-'`` i nie wyglądają jak liczby ujemne, możesz wstawić pseudo parametr ``'--'`` który mówi ``parse_args``, że wszystko potem jest parametrem pozycyjnym::

source: Argument abbreviations
pl: Skróty parametrów

source: The :meth:`parse_args` method allows long options to be abbreviated if the abbreviation is unambiguous::
pl: Sposób postępowania :meth:`parse_args` pozwala na skracanie długich opcji jeśli skrót nie jest wieloznaczny::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-bacon') >>> parser.add_argument('-badger') >>> parser.parse_args('-bac MMM'.split()) Namespace(bacon='MMM', badger=None) >>> parser.parse_args('-bad WOOD'.split()) Namespace(bacon=None, badger='WOOD') >>> parser.parse_args('-ba BA'.split()) usage: PROG [-h] [-bacon BACON] [-badger BADGER] PROG: error: ambiguous option: -ba could match -badger, -bacon
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('-bolak') >>> parser.add_argument('-borsuk') >>> parser.parse_args('-bol MMM'.split()) Namespace(bolak='MMM', borsuk=None) >>> parser.parse_args('-bor DRZEWO'.split()) Namespace(bolak=None, borsuk='DRZEWO') >>> parser.parse_args('-bo BO'.split()) użycie:PROG [-h] [-bolak BOLAK] [-borsuk BORSUK] PROG: błąd: wieloznaczna opcja -bo może pasować do borsuka i bolaka

source: An error is produced for arguments that could produce more than one options.
pl: Błąd jest tworzony dla parametrów które mogłyby stworzyć więcej niż jedną opcję.

source: Beyond ``sys.argv``
pl: Poza ``sys.argv``

source: Sometimes it may be useful to have an ArgumentParser parse args other than those of :data:`sys.argv`. This can be accomplished by passing a list of strings to ``parse_args``. This is useful for testing at the interactive prompt::
pl: Czasami może być użyteczne wczytanie parametrów przez uogólnienie ArgumentParser innych niż te z :data:`sys.argv`. To można osiągnąć przez przekazanie listy ciągów znaków dla ``parse_args``. To jest użyteczne dla testowania współdziałającego wiersza zapytań::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument( ... 'integers', metavar='int', type=int, choices=xrange(10), ... nargs='+', help='an integer in the range 0..9') >>> parser.add_argument( ... '--sum', dest='accumulate', action='store_const', const=sum, ... default=max, help='sum the integers (default: find the max)') >>> parser.parse_args(['1', '2', '3', '4']) Namespace(accumulate=<built-in function max>, integers=[1, 2, 3, 4]) >>> parser.parse_args('1 2 3 4 --sum'.split()) Namespace(accumulate=<built-in function sum>, integers=[1, 2, 3, 4])
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument( ... 'integers', metavar='int', type=int, choices=xrange(10), ... nargs='+', help='liczba całkowita z przedziału 0..9') >>> parser.add_argument( ... '--sum', dest='accumulate', action='store_const', const=sum, ... default=max, help='suma liczb całkowitych (domyślnie: znajdź maksimum)') >>> parser.parse_args(['1', '2', '3', '4']) Namespace(accumulate=<zadanie wbudowane max>, integers=[1, 2, 3, 4]) >>> parser.parse_args('1 2 3 4 --sum'.split()) Namespace(accumulate=<zadanie wbudowane sum>, integers=[1, 2, 3, 4])

source: Custom namespaces
pl: Szczególne przestrzenie nazw

source: It may also be useful to have an :class:`ArgumentParser` assign attributes to an already existing object, rather than the newly-created :class:`Namespace` object that is normally used. This can be achieved by specifying the ``namespace=`` keyword argument::
pl: To może być także użyteczne, aby uogólnienie :class:`ArgumentParser` przypisało właściwości do już istniejącego przedmiotu, zamiast do nowo-tworzonego przedmiotu :class:`Namespace`. To można osiągnąć przez użycie parametru słowa kluczowego ``namespace=``::

source: Other utilities
pl: Inne użytki

source: Sub-commands
pl: podrzędne polecenia

source: Many programs split up their functionality into a number of sub-commands, for example, the ``svn`` program can invoke sub-commands like ``svn checkout``, ``svn update``, and ``svn commit``. Splitting up functionality this way can be a particularly good idea when a program performs several different functions which require different kinds of command-line arguments. :class:`ArgumentParser` supports the creation of such sub-commands with the :meth:`add_subparsers` method. The :meth:`add_subparsers` method is normally called with no arguments and returns an special action object. This object has a single method, ``add_parser``, which takes a command name and any :class:`ArgumentParser` constructor arguments, and returns an :class:`ArgumentParser` object that can be modified as usual.
pl: Wiele programów dzieli swoje możliwości działania na pewną liczbę podrzędnych poleceń, na przykład program svn może wywoływać podrzędne polecenia takie jak ``svn checkout``, ``svn update``, i ``svn commit``. Dzielenie możliwości działania w ten sposób może być szczególnie dobrym pomysłem gdy program wykonuje kilka różnych działań które wymagają różnego rodzaju parametrów wiersza-poleceń. Uogólnienie :class:`ArgumentParser` wspiera tworzenie takich podrzędnych poleceń za pomocą sposobu postępowania :meth:`add_subparsers. Sposób postępowania :meth:`add_subparsers` jest zwykle wywoływany bez parametrów i zwraca szczególny przedmiot działania. Ten przedmiot ma pojedynczy sposób postępowania, ``add_parser``, który pobiera nazwę polecenia i dowolne parametry konstruktora, i zwraca przedmiot :class:`ArgumentParser`, który może być modyfikowany w znane sposoby.

source: Some example usage::
pl: Pewne przykładowe użycie::

source: >>> # create the top-level parser >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', action='store_true', help='foo help') >>> subparsers = parser.add_subparsers(help='sub-command help') >>> >>> # create the parser for the "a" command >>> parser_a = subparsers.add_parser('a', help='a help') >>> parser_a.add_argument('bar', type=int, help='bar help') >>> >>> # create the parser for the "b" command >>> parser_b = subparsers.add_parser('b', help='b help') >>> parser_b.add_argument('--baz', choices='XYZ', help='baz help') >>> >>> # parse some arg lists >>> parser.parse_args(['a', '12']) Namespace(bar=12, foo=False) >>> parser.parse_args(['--foo', 'b', '--baz', 'Z']) Namespace(baz='Z', foo=True)
pl: >>> # stwórz nadrzędnego poziomu czytnik >>> parser = argparse.ArgumentParser(prog='PROG') >>> parser.add_argument('--foo', action='store_true', help='pomoc foo') >>> subparsers = parser.add_subparsers(help='pomoc podrzędnego polecenia') >>> >>> # utwórz czytnik dla polecenia "a" >>> parser_a = subparsers.add_parser('a', help='pomoc a') >>> parser_a.add_argument('bar', type=int, help='pomoc bar') >>> >>> # utwórz czytnik dla polecenia "b" >>> parser_b = subparsers.add_parser('b', help='pomoc b') >>> parser_b.add_argument('--baz', choices='XYZ', help='pomoc baz') >>> >>> # wczytaj pewne listy parametrów >>> parser.parse_args(['a', '12']) Namespace(bar=12, foo=False) >>> parser.parse_args(['--foo', 'b', '--baz', 'Z']) Namespace(baz='Z', foo=True)

source: Note that the object returned by :meth:`parse_args` will only contain attributes for the main parser and the subparser that was selected by the command line (and not any other subparsers). So in the example above, when the ``"a"`` command is specified, only the ``foo`` and ``bar`` attributes are present, and when the ``"b"`` command is specified, only the ``foo`` and ``baz`` attributes are present.
pl: Zauważ że przedmiot zwracany przez sposób postępowania :meth:`parse_args` będzie zawierał tylko właściwości dla głównego czytnika i podrzędnego czytnika, który został wybrany przez wiersz polecenia (i żadne inne podrzędne czytniki). Więc w powyższym przykładzie gdy polecenie ``"a"`` jest określane, tylko właściwości ``foo`` i ``bar`` są obecne, i gdy polecenie ``"b"`` jest określane, tylko właściwości ``foo`` i ``baz`` są obecne.

source: Similarly, when a help message is requested from a subparser, only the help for that particular parser will be printed. The help message will not include parent parser or sibling parser messages. (A help message for each subparser command, however, can be given by supplying the ``help=`` argument to ``add_parser`` as above.)
pl: Podobnie, gdy wiadomość pomocy jest oczekiwana od podrzędnego czytnika, tylko pomoc dla tego konkretnego czytnika będzie wypisana. Wiadomość pomocy nie będzie zawierała czytnika nadrzędnego ani wiadomości siostrzanych czytników. (Wiadomość pomocy dla każdego polecenia podrzędnego czytnika, może być podana przez dostarczenie parametru ``help=`` dla ``add_parser`` jak powyżej.)

source: >>> parser.parse_args(['--help']) usage: PROG [-h] [--foo] {a,b} ... positional arguments: {a,b} sub-command help a a help b b help optional arguments: -h, --help show this help message and exit --foo foo help >>> parser.parse_args(['a', '--help']) usage: PROG a [-h] bar positional arguments: bar bar help optional arguments: -h, --help show this help message and exit >>> parser.parse_args(['b', '--help']) usage: PROG b [-h] [--baz {X,Y,Z}] optional arguments: -h, --help show this help message and exit --baz {X,Y,Z} baz help
pl: >>> parser.parse_args(['--help']) użycie: PROG [-h] [--foo] {a,b} ... pozycyjne parametry: {a,b} pomoc podrzędnych poleceń a a pomoc b b pomoc opcjonalne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź --foo pomoc foo >>> parser.parse_args(['a', '--help']) użycie: PROG a [-h] bar pozycyjne parametry: -h, --help pokaż tą wiadomość pomocy i wyjdź >>> parser.parse_args(['b', '--help']) użycie: PROG b [-h] [--baz {X,Y,Z}] opcjonalne parametry: -h --help pokaż tą wiadomość pomocy i wyjdź --baz {X,Y,Z} pomoc baz

source: The :meth:`add_subparsers` method also supports ``title`` and ``description`` keyword arguments. When either is present, the subparser's commands will appear in their own group in the help output. For example::
pl: Sposób postępowania :meth:`add_subparsers` także wspiera parametry słów kluczowych ``tytuł`` i ``opis`` - z ang - ``title`` i ``description``. Gdy którykolwiek z nich jest obecny, podrzędne polecenia będą pojawiały się w swoich własnych grupach w wyjściu produkowanym przez pomoc. Dla przykładu::

source: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(title='subcommands', ... description='valid subcommands', ... help='additional help') >>> subparsers.add_parser('foo') >>> subparsers.add_parser('bar') >>> parser.parse_args(['-h']) usage: [-h] {foo,bar} ... optional arguments: -h, --help show this help message and exit subcommands: valid subcommands {foo,bar} additional help
pl: >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers(title='podrzędne polecenia', ... description='poprawne podrzędne polecenia', ... help='dodatkowa pomoc') >>> subparsers.add_parser('foo') >>> subparsers.add_parser('bar') >>> parser.parse_args(['-h']) użycie: [-h] {foo,bar} ... opcjonalne parametry: -h --help pokaż tą wiadomość pomocy i wyjdź podrzędne polecenia: poprawne podrzędne polecenia {foo,bar} dodatkowa pomoc

source: One particularly effective way of handling sub-commands is to combine the use of the :meth:`add_subparsers` method with calls to :meth:`set_defaults` so that each subparser knows which Python function it should execute. For example::
pl: Jednym ze szczególnie efektywnych sposobów obsługi podrzędnych poleceń jest połączenie użycia :meth:`add_subparsers` z wywołaniami :meth:`set_defaults` tak że każdy podrzędny czytnik wie które zadanie powinien wykonywać. Dla przykładu::

source: >>> # sub-command functions >>> def foo(args): ... print(args.x * args.y) ... >>> def bar(args): ... print('((%s))' % args.z) ... >>> # create the top-level parser >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers() >>> >>> # create the parser for the "foo" command >>> parser_foo = subparsers.add_parser('foo') >>> parser_foo.add_argument('-x', type=int, default=1) >>> parser_foo.add_argument('y', type=float) >>> parser_foo.set_defaults(func=foo) >>> >>> # create the parser for the "bar" command >>> parser_bar = subparsers.add_parser('bar') >>> parser_bar.add_argument('z') >>> parser_bar.set_defaults(func=bar) >>> >>> # parse the args and call whatever function was selected >>> args = parser.parse_args('foo 1 -x 2'.split()) >>> args.func(args) 2.0 >>> >>> # parse the args and call whatever function was selected >>> args = parser.parse_args('bar XYZYX'.split()) >>> args.func(args) ((XYZYX))
pl: >>> # podrzędne zadania >>> def foo(args): ... print(args.x * args.y) ... >>> def bar(args): ... print('((%s))' % args.z) ... >>> #utwórz nadrzędnego poziomu czytnik >>> parser = argparse.ArgumentParser() >>> subparsers = parser.add_subparsers() >>> # utwórz czytnik dla polecenia "foo" >>> parser_foo = subparsers.add_parser('foo') >>> parser_foo.add_argument('-x', type=int, default=1) >>> parser_foo.add_argument('y', type=float) >>> parser_foo.set_defaults(func=foo) >>> >>> # utwórz czytnik dla polecenia "bar" >>> parser_bar = subparsers.add_parser('bar') >>> parser_bar.add_argument('z') >>> parser_bar.set_defaults(func=bar) >>> >>> # wczytaj parametry i wywołaj to zadanie które zostało wybrane >>> args = parser.parse_args('foo 1 -x 2'.split()) >>> args.func(args) 2.0 >>> >>> # wczytaj parametry i wywołaj dowolne zadanie które zostało wybrane >>> args = parser.parse_args('bar XYZYX'.split()) >>> args.func(args) ((XYZYX))

source: This way, you can let :meth:`parse_args` does the job of calling the appropriate function after argument parsing is complete. Associating functions with actions like this is typically the easiest way to handle the different actions for each of your subparsers. However, if it is necessary to check the name of the subparser that was invoked, the ``dest`` keyword argument to the :meth:`add_subparsers` call will work::
pl: Tym sposobem możesz pozwolić aby sposób postępowania :meth:`parse_args` wykona pracę wywołania odpowiedniego zadania po dokończeniu wczytywania parametrów. Połączenie zadań z działaniami w ten sposób jest typowo najłatwiejszym sposobem aby obsłużyć różne działania każdego z podrzędnych czynników. Jednakże, jeśli jest konieczne sprawdzenie nazwy podrzędnego czytnika który został wywołany, parametr słowa kluczowego ``dest`` dla wywołania sposobu postępowania :meth:`add_subparsers` będzie działał::

source: FileType objects
pl: przedmioty FileType

source: The :class:`FileType` factory creates objects that can be passed to the type argument of :meth:`ArgumentParser.add_argument`. Arguments that have :class:`FileType` objects as their type will open command-line args as files with the requested modes and buffer sizes:
pl: Fabryka :class:`FileType` tworzy przedmioty które mogą być przekazywane dla typu parametru sposobu postępowania :meth:`ArgumentParser.add_argument`. Parametry które mają przedmioty uogólnienia :class:`FileType` jako ich typ otwierają parametry wiersza-polecenia jako pliki z żądanymi trybami i rozmiarami przestrzeni wymiany:

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--output', type=argparse.FileType('wb', 0)) >>> parser.parse_args(['--output', 'out']) Namespace(output=<open file 'out', mode 'wb' at 0x...>)
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('--output', type=argparse.FileType('wb', 0)) >>> parser.parse_args(['--output', 'out']) Namespace(output=<otwarty plik 'out', tryb 'wb' w 0x...>)

source: FileType objects understand the pseudo-argument ``'-'`` and automatically convert this into ``sys.stdin`` for readable :class:`FileType` objects and ``sys.stdout`` for writable :class:`FileType` objects:
pl: Przedmioty FileType rozróżniają pseudo-parametr ``'-'`` i automatycznie zamieniają go w ``sys.stdin`` dla czytelnych przedmiotów :class:`FileType` i ``sys.stdout`` dla możliwych do zapisania przedmiotów :class:`FileType`:

source: Argument groups
pl: Grupy parametrów

source: By default, :class:`ArgumentParser` groups command-line arguments into "positional arguments" and "optional arguments" when displaying help messages. When there is a better conceptual grouping of arguments than this default one, appropriate groups can be created using the :meth:`add_argument_group` method::
pl: Domyślnie uogólnienie :class:`ArgumentParser` grupuje parametry wiersza-polecenia w "parametry pozycyjne" i "parametry opcjonalne" podczas wyświetlania wiadomości pomocy. Gdy istnieje lepszy koncept zgrupowania parametrów niż ten domyślny, właściwe grupy mogą być tworzone przy użyciu sposobu postępowania :meth:`add_argument_group`::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group = parser.add_argument_group('group') >>> group.add_argument('--foo', help='foo help') >>> group.add_argument('bar', help='bar help') >>> parser.print_help() usage: PROG [--foo FOO] bar group: bar bar help --foo FOO foo help
pl: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> grupa = parser.add_argument_group('grupa') >>> group.add_argument('--foo', help='foo help') >>> group.add_argument('bar', help='bar help') >>> parser.print_help() użycie: PROG [--foo FOO] bar grupa: bar pomoc bar --foo FOO foo help

source: The :meth:`add_argument_group` method returns an argument group object which has an :meth:`~ArgumentParser.add_argument` method just like a regular :class:`ArgumentParser`. When an argument is added to the group, the parser treats it just like a normal argument, but displays the argument in a separate group for help messages. The :meth:`add_argument_group` method accepts ``title`` and ``description`` arguments which can be used to customize this display::
pl: Sposób postępowania :meth:`add_argument_group` zwraca przedmiot grupy parametrów, który ma sposób postępowania :meth:`~ArgumentParser.add_argument` tak jak zwykłe uogólnienie :class:`ArgumentParser`. Gdy parametr jest dodawany do grupy czytnik traktuje go jak zwykły parametr, ale wyświetla parametr w oddzielnej grupie dla wiadomości pomocy. Sposób postępowania :meth:`add_argument_group` akceptuje parametry ``title i ``description`` - z ang. - ``tytuł`` i ``opis``, które mogą być użyte do dostosowania wyświetlania::

source: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group1 = parser.add_argument_group('group1', 'group1 description') >>> group1.add_argument('foo', help='foo help') >>> group2 = parser.add_argument_group('group2', 'group2 description') >>> group2.add_argument('--bar', help='bar help') >>> parser.print_help() usage: PROG [--bar BAR] foo group1: group1 description foo foo help group2: group2 description --bar BAR bar help
pl: >>> parser = argparse.ArgumentParser(prog='PROG', add_help=False) >>> group1 = parser.add_argument_group('group1', 'opis group1') >>> group1.add_argument('foo', help='pomoc foo') >>> group2 = parser.add_argument_group('group2', 'opis group2') >>> group2.add_argument('--bar', help='pomoc bar') >>> parser.print_help() użycie: PROG [--bar BAR] foo group1: opis group1 foo pomoc foo group2: opis group2 --bar BAR pomoc bar

source: Note that any arguments not your user defined groups will end up back in the usual "positional arguments" and "optional arguments" sections.
pl: Zauważ że wszelkie parametry nie w twoich zdefiniowanych grupach skończą z powrotem w dotychczasowych sekcjach "parametrów pozycyjnych" i "parametrach opcjonalnych".

source: Mutual exclusion
pl: Wzajemne wykluczenia

source: Create a mutually exclusive group. argparse will make sure that only one of the arguments in the mutually exclusive group was present on the command line::
pl: Stwórz wzajemnie wykluczającą się grupę. argparse będzie pilnował żeby tylko pojedynczy parametr we wzajemnie wykluczających się grupach był obecny w wierszu poleceń::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group() >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args(['--foo']) Namespace(bar=True, foo=True) >>> parser.parse_args(['--bar']) Namespace(bar=False, foo=False) >>> parser.parse_args(['--foo', '--bar']) usage: PROG [-h] [--foo | --bar] PROG: error: argument --bar: not allowed with argument --foo
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group() >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args(['--foo']) Namespace(bar=True, foo=True) >>> parser.parse_args(['--bar']) Namespace(bar=False, foo=False) >>> parser.parse_args(['--foo', '--bar']) użycie: PROG [-h] [--foo | --bar] PROG: błąd: parametr --bar: nie dozwolony z parametrem --foo

source: The :meth:`add_mutually_exclusive_group` method also accepts a ``required`` argument, to indicate that at least one of the mutually exclusive arguments is required::
pl: Sposób postępowania :meth:`add_mutually_exclusive_group` przyjmuje także parametr ``wymagane`` - z ang. - ``required``, aby wskazać że co najmniej jeden z wzajemnie wykluczających się parametrów jest wymagany::

source: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group(required=True) >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args([]) usage: PROG [-h] (--foo | --bar) PROG: error: one of the arguments --foo --bar is required
pl: >>> parser = argparse.ArgumentParser(prog='PROG') >>> group = parser.add_mutually_exclusive_group(required=True) >>> group.add_argument('--foo', action='store_true') >>> group.add_argument('--bar', action='store_false') >>> parser.parse_args([]) użycie: PROG [-h] (--foo | --bar) PROG: błąd: jeden z parametrów --foo --bar jest wymagany

source: Note that currently mutually exclusive argument groups do not support the ``title`` and ``description`` arguments of :meth:`add_argument_group`.
pl: Zauważ że obecnie wzajemnie wykluczające się grupy parametrów nie wspierają parametrów ``tytułu`` i ``opisu`` - z ang. - ``title`` i ``description`` dla sposobu postępowania :meth:`add_argument_group`.

source: Parser defaults
pl: Domyślne czytnika

source: Most of the time, the attributes of the object returned by :meth:`parse_args` will be fully determined by inspecting the command-line args and the argument actions. :meth:`ArgumentParser.set_defaults` allows some additional attributes that are determined without any inspection of the command-line to be added::
pl: W większości przypadków, właściwości przedmiotów zwracanych przez :meth:`parse_args` w pełni są określone przez sprawdzenie parametrów wiersza poleceń i akcji parametrów. Sposób postępowania :meth:`ArgumentParser.set_defaults` pozwala na dodanie pewnych dodatkowych właściwości określanych bez żadnego sprawdzenia wiersza poleceń::

source: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('foo', type=int) >>> parser.set_defaults(bar=42, baz='badger') >>> parser.parse_args(['736']) Namespace(bar=42, baz='badger', foo=736)
pl: >>> parser = argparse.ArgumentParser() >>> parser.add_argument('foo', type=int) >>> parser.set_defaults(bar=42, baz='borsuk') >>> parser.parse_args(['736']) Namespace(bar=42, baz='borsuk', foo=736)

source: Note that parser-level defaults always override argument-level defaults::
pl: Zauważ, że wartości domyślne na poziomie czytnika zawsze przesłaniają wartości domyślne na poziomie parametrów::
